SZTU-wearable/Tiny-PPG/STM32_implementation/PPG.ioc
STMicroelectronics.X-CUBE-AI.7.3.0.IPParameters=BSP.condition,MaximumNumberOfOutputLayer,ActivationBuffers,BSP.api,BSP.STBoard,BSP.instance,StackSize,BSP.solution,BSP.ip,ReadyForCodeGeneration,BSP.name,DeviceJjApplication_Checked,BSP.mode,HeapSize,ActivationBufferSizeList,InternalRamActivationBufferMaxSize,BSP.number,MaximumNumberOfInputLayer,MaximumSizeOfInputLayer,MaximumSizeOfOutputLayer,ActivationSizes,ActivationNames,ModelName-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelType-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelKind-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelCompression-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelHashList,ModelNameList,LatestDirectoryUsed-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelStructureFile-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,XAaCUBEAaAICcArtificialOoIntelligenceJjCore,ApplicationCcDeviceJjApplication,WorkingBufferStartAddrList,ModelRamOccupation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelFlashOccupation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelMacc-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,ModelActualCompression-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,copyWeightToRam-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,useInputAllocation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,useOutputAllocation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8,customLayerConfigEnabled-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8
STMicroelectronics.X-CUBE-AI.7.3.0.InternalRamActivationBufferMaxSize=AI_PPG_NETWORK_DATA_ACTIVATIONS_SIZE
STMicroelectronics.X-CUBE-AI.7.3.0.LatestDirectoryUsed-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=D\:\\zzz\\ML\\Segade-main
STMicroelectronics.X-CUBE-AI.7.3.0.MaximumNumberOfInputLayer=1
STMicroelectronics.X-CUBE-AI.7.3.0.MaximumNumberOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.7.3.0.MaximumSizeOfInputLayer=1
STMicroelectronics.X-CUBE-AI.7.3.0.MaximumSizeOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.7.3.0.ModelActualCompression-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=0.0
STMicroelectronics.X-CUBE-AI.7.3.0.ModelCompression-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=None
STMicroelectronics.X-CUBE-AI.7.3.0.ModelFlashOccupation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=60192
STMicroelectronics.X-CUBE-AI.7.3.0.ModelHashList=d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8
STMicroelectronics.X-CUBE-AI.7.3.0.ModelKind-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=KERAS
STMicroelectronics.X-CUBE-AI.7.3.0.ModelMacc-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=2559848
STMicroelectronics.X-CUBE-AI.7.3.0.ModelName-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=ppg_network
STMicroelectronics.X-CUBE-AI.7.3.0.ModelNameList=ppg_network
STMicroelectronics.X-CUBE-AI.7.3.0.ModelRamOccupation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=134820
STMicroelectronics.X-CUBE-AI.7.3.0.ModelStructureFile-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=D\:\\zzz\\ML\\Segade-main\\ppg_motion_model.h5
STMicroelectronics.X-CUBE-AI.7.3.0.ModelType-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=Saved model
STMicroelectronics.X-CUBE-AI.7.3.0.ReadyForCodeGeneration=true
STMicroelectronics.X-CUBE-AI.7.3.0.StackSize=0x2000
STMicroelectronics.X-CUBE-AI.7.3.0.WorkingBufferStartAddrList=0xFFFFFFFF
STMicroelectronics.X-CUBE-AI.7.3.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.7.3.0.copyWeightToRam-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=false
STMicroelectronics.X-CUBE-AI.7.3.0.customLayerConfigEnabled-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=false
STMicroelectronics.X-CUBE-AI.7.3.0.useInputAllocation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=true
STMicroelectronics.X-CUBE-AI.7.3.0.useOutputAllocation-d65ad06495b38c94e74c4288be09399d0ffcee947c89f38640ba4cf4855b16b8=true
STMicroelectronics.X-CUBE-AI.7.3.0_SwParameter=ApplicationCcDeviceJjApplication\:ApplicationTemplate;XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;
TIM6.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM6.IPParameters=AutoReloadPreload,Prescaler,Period
TIM6.Period=26
TIM6.Prescaler=62499
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
USB_DEVICE.APP_RX_DATA_SIZE-CDC_FS=64
USB_DEVICE.APP_TX_DATA_SIZE-CDC_FS=64
USB_DEVICE.CLASS_NAME_FS=CDC
USB_DEVICE.IPParameters=VirtualMode-CDC_FS,VirtualModeFS,CLASS_NAME_FS,APP_RX_DATA_SIZE-CDC_FS,APP_TX_DATA_SIZE-CDC_FS
USB_DEVICE.VirtualMode-CDC_FS=Cdc
USB_DEVICE.VirtualModeFS=Cdc_FS
USB_OTG_FS.IPParameters=VirtualMode
USB_OTG_FS.VirtualMode=Device_Only
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_DMA2D_VS_DMA2D.Mode=DMA2D_Activate
VP_DMA2D_VS_DMA2D.Signal=DMA2D_VS_DMA2D
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_7.3.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_7.3.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_7.3.0
VP_STMicroelectronics.X-CUBE-AI_VS_DeviceJjApplication_7.3.0.Mode=DeviceJjApplication
VP_STMicroelectronics.X-CUBE-AI_VS_DeviceJjApplication_7.3.0.Signal=STMicroelectronics.X-CUBE-AI_VS_DeviceJjApplication_7.3.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
board=custom
isbadioc=false
